# 4. Напишите программу, которая по заданному номеру четверти,
# показывает диапазон возможных координат точек в этой четверти (x и y).

# n = int(input('Введите номер четверти: '))
# if n == 1:
#     print('x>0 and y>0')
# elif n == 2:
#     print('x>0 and y<0')
# elif n == 3:
#     print('x<0 and y<0')
# elif n == 4:
#     print('x<0 and y>0')
# else:
#     print('Такой четверти нет')


x = int(input('Введите номер четверти от 1 до 4: '))

if x == 1:
    print('X => (0, ∞), -  Y => (0, ∞)')
elif x == 2:
    print('X => (-∞, 0), - Y => (0, ∞)')
elif x == 3:
    print('X => (-∞, 0), - Y => (-∞, 0)')
elif x == 4:
    print('X => (0, ∞), - Y => (-∞, 0)')
else:
    print('Такой четверти не существует!')